; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=3, packages=2, locations=8, density=0.2857142857142857, fully_connected=False, max_capacity=2, out_folder=./sparse/training, instance_id=13, seed=54

(define (problem transport-13)
 (:domain transport)
 (:objects 
    v1 v2 v3 - vehicle
    p1 p2 - package
    l1 l2 l3 l4 l5 l6 l7 l8 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l8)
    (at p2 l8)
    (at v1 l7)
    (at v2 l4)
    (at v3 l8)
    (road l2 l4)
    (road l7 l1)
    (road l8 l4)
    (road l7 l5)
    (road l3 l1)
    (road l4 l6)
    (road l6 l4)
    (road l4 l2)
    (road l5 l7)
    (road l2 l3)
    (road l1 l7)
    (road l4 l8)
    (road l3 l2)
    (road l1 l3)
    (road l4 l5)
    (road l5 l4)
    )
 (:goal  (and 
    (at p1 l1)
    (at p2 l3))))

; plan
1. (pick-up v3 l8 p1 c1 c2)
   deleted: (at p1 l8) (capacity v3 c2)
   added: (in p1 v3) (capacity v3 c1)
   goals met: 0 of 2
2. (pick-up v3 l8 p2 c0 c1)
   deleted: (at p2 l8) (capacity v3 c1)
   added: (in p2 v3) (capacity v3 c0)
   goals met: 0 of 2
3. (drive v3 l8 l4)
   deleted: (at v3 l8)
   added: (at v3 l4)
   goals met: 0 of 2
4. (drive v3 l4 l2)
   deleted: (at v3 l4)
   added: (at v3 l2)
   goals met: 0 of 2
5. (drive v3 l2 l3)
   deleted: (at v3 l2)
   added: (at v3 l3)
   goals met: 0 of 2
6. (drop v3 l3 p2 c0 c1)
   deleted: (in p2 v3) (capacity v3 c0)
   added: (at p2 l3) (capacity v3 c1)
   goals met: 1 of 2
7. (drive v3 l3 l1)
   deleted: (at v3 l3)
   added: (at v3 l1)
   goals met: 1 of 2
8. (drop v3 l1 p1 c1 c2)
   deleted: (in p1 v3) (capacity v3 c1)
   added: (at p1 l1) (capacity v3 c2)
   goals met: 2 of 2
